## Staging: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                               |
|--------|-----------------------------------------------------------------|
| add    | `aws_quicksight_data_set.dashboard-notification-counts`         |
|        | `aws_quicksight_refresh_schedule.dashboard-notification-counts` |
| update | `aws_s3_object.manifest_file`                                   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_quicksight_data_set.dashboard-notification-counts will be created
  + resource "aws_quicksight_data_set" "dashboard-notification-counts" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "dashboard-notification-counts"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "Dashboard notification counts"
      + output_columns = (known after apply)
      + tags_all       = (known after apply)

      + permissions {
          + actions   = [
              + "quicksight:CancelIngestion",
              + "quicksight:CreateIngestion",
              + "quicksight:DeleteDataSet",
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
              + "quicksight:UpdateDataSet",
              + "quicksight:UpdateDataSetPermissions",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-owners"
        }
      + permissions {
          + actions   = [
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-viewers"
        }

      + physical_table_map {
          + physical_table_map_id = "notification-counts"

          + custom_sql {
              + data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/NotificationCanadaCastaging"
              + name            = "dashboard-notification-counts"
              + sql_query       = <<-EOT
                    WITH n AS (
                              SELECT
                                service_id,
                                COUNT(id) AS n_count,
                                DATE_PART('day', created_at) AS day
                              FROM notifications
                              WHERE
                                created_at >= DATE_TRUNC('day', NOW()) - interval '14 days'
                                AND created_at <= (DATE_TRUNC('day', NOW()) + interval '1 day' - interval '1 second')
                                AND key_type <> 'test'
                              GROUP BY
                                DATE_PART('day', created_at),
                                service_id
                              ORDER BY day
                            ),
                            nh AS (
                              SELECT
                                service_id,
                                COUNT(id) AS nh_count,
                                DATE_PART('day', created_at) AS day
                              FROM notification_history
                              WHERE
                                created_at >= DATE_TRUNC('day', NOW()) - interval '14 days'
                                AND created_at <= (DATE_TRUNC('day', NOW()) + interval '1 day' - interval '1 second')
                                AND key_type <> 'test'
                              GROUP BY
                                DATE_PART('day', created_at),
                                service_id
                              ORDER BY day, service_id
                            ),
                            ft AS (
                              SELECT
                                service_id,
                                SUM(notification_count) AS ft_count,
                                DATE_PART('day', bst_date) AS day
                              FROM ft_notification_status
                              WHERE
                                bst_date >= DATE_TRUNC('day', NOW()) - interval '14 days'
                                AND bst_date <= (DATE_TRUNC('day', NOW()) + interval '1 day' - interval '1 second')
                                AND key_type <> 'test'
                              GROUP BY
                                DATE_PART('day', bst_date),
                                service_id
                              ORDER BY day
                            )
                            SELECT
                              COALESCE(n.service_id, nh.service_id, ft.service_id) AS service_id,
                              COALESCE(n.day, nh.day, ft.day) AS day,
                              n.n_count,
                              nh.nh_count,
                              ft.ft_count,
                              CASE
                                WHEN nh.nh_count IS NOT NULL AND ft.ft_count IS NOT NULL AND nh.nh_count <> ft.ft_count THEN '❌'
                                ELSE '✅'
                              END AS count_comparison
                            FROM n
                            FULL OUTER JOIN nh
                              ON n.day = nh.day AND n.service_id = nh.service_id
                            FULL OUTER JOIN ft
                              ON COALESCE(n.day, nh.day) = ft.day
                              AND COALESCE(n.service_id, nh.service_id) = ft.service_id
                            ORDER BY day, service_id
                EOT

              + columns {
                  + name = "service_id"
                  + type = "STRING"
                }
              + columns {
                  + name = "day"
                  + type = "INTEGER"
                }
              + columns {
                  + name = "n_count"
                  + type = "INTEGER"
                }
              + columns {
                  + name = "nh_count"
                  + type = "INTEGER"
                }
              + columns {
                  + name = "ft_count"
                  + type = "INTEGER"
                }
              + columns {
                  + name = "count_comparison"
                  + type = "STRING"
                }
            }
        }
    }

  # aws_quicksight_refresh_schedule.dashboard-notification-counts will be created
  + resource "aws_quicksight_refresh_schedule" "dashboard-notification-counts" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "dashboard-notification-counts"
      + id             = (known after apply)
      + schedule_id    = "schedule-dashboard-notification-counts"

      + schedule {
          + refresh_type          = "FULL_REFRESH"
          + start_after_date_time = (known after apply)

          + schedule_frequency {
              + interval        = "DAILY"
              + time_of_the_day = "01:00"
              + timezone        = (known after apply)
            }
        }
    }

  # aws_s3_object.manifest_file will be updated in-place
  ~ resource "aws_s3_object" "manifest_file" {
      ~ etag                   = "4f558e8d8cdbbf914a95755cbda61968" -> "221f592f333f2fc284626cfdb8c4bc80"
        id                     = "quicksight/s3-manifest-sms-usage.json"
        tags                   = {}
      + version_id             = (known after apply)
        # (12 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudformation_stack.sms-usage-notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-s3-usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.dashboard-notification-counts"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.jobs"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.login_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.organisation"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.template-category-history"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.users"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.s3_sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.manifest_file"]

40 tests, 19 passed, 21 warnings, 0 failures, 0 exceptions

```

</details>
